<?

$po = 10;

$since = file_get_contents('php://input');
$since = json_decode($since, true);
$since = $since['goodsOnPage'];

$ar = array(1=>"Товар_1", 2=>"Товар_2", 3=>"Товар_3", 4=>"Товар_4", 5=>"Товар_5", 6=>"Товар_6", 7=>"Товар_7", 8=>"Товар_8", 9=>"Товар_9", 10=>"Товар_10", 11=>"Товар_11", 12=>"Товар_12", 13=>"Товар_13", 14=>"Товар_14", 15=>"Товар_15", 16=>"Товар_16", 17=>"Товар_17", 18=>"Товар_18", 19=>"Товар_19", 20=>"Товар_20", 21=>"Товар_21", 22=>"Товар_22", 23=>"Товар_23", 24=>"Товар_24", 25=>"Товар_25", 26=>"Товар_26", 27=>"Товар_27", 28=>"Товар_28", 29=>"Товар_29", 30=>"Товар_30", 31=>"Товар_31", 32=>"Товар_32", 33=>"Товар_33", 34=>"Товар_34", 35=>"Товар_35", 36=>"Товар_36", 37=>"Товар_37", 38=>"Товар_38", 39=>"Товар_39", 40=>"Товар_40");

$leftGoods = count($ar)-$since;

if($leftGoods!==0){
if($leftGoods>=$po){

	$otpr = array_slice ($ar, $since, $po);
}
else {
$otpr = array_slice ($ar, $since, $leftGoods);
}
}else{
$otpr=array();
}



echo json_encode($otpr);
?>
